/** 
 * 获取闭区间 [n, m] 内的一个随机整数
 * 算法应用： 洗牌算法
*/
// 说明：
// +--------------------------------------------------------------------------+
// | Math.random() 返回[0, 1)范围浮点数数值；                                    |
// | 这里我们需要得到的随机数范围是[n,m]                                           |
// | [0, m-n+1) +n --> [n, m+1)——>[n,m]                                       |
// |                                                                          |
// +--------------------------------------------------------------------------+
   
function randOne(n, m) {                                                                                                                
    return Math.floor(Math.random() * (m - n + 1)) + n;                                                                                 
}
